{
    "Polytron4000": {
    "initial": {
    "text": "Du siehst ein paar schrottige Roboter, die darauf Warten, dass das Polytron4000 abheben kann. Wo bleibt der Hyperraumantrieb?",
    "choices": [
    {
    "text": "Hyperraumantrieb in den Hyperraum-Antriebsschlitz stecken.",
    "condition": "hashyperraumantrieb",
    "action": "win_game"
    },
    {
    "text": "Polytron4000 genauer betrachten.",
    "action": "examine_polytron"
    },
    {
    "text": "Erstmal weiter zu den anderen Floors.",
    "action": "close"
    }
    ]
    },
    "examine_polytron": {
    "text": "Hier und da bekriegen sich einige rostige Roboter, vor dem zentralen Mapping steht eine kathatonische Gestalt, die mit ihren Extremitaeten seltsame Verrekungen macht.",
    "choices": [
    {
    "text": "Puh, mal lieber weiter den Hyperraumantrieb suchen...",
    "action": "close"
    }
    ]
    }
    },
    "Brausecus": {
    "initial": {
    "text": "Hae, war Brausecus nicht woanders?",
    "choices": [
    {
    "text": "Erstmal n' Bier aufmachen. Du schuettest dein komplettes Bier auf eine freiliegende Mehrfachsteckdose",
    "action": "open_beer"
    },
    {
    "text": "Punk ist mir echt zu stressig. Hier siehts nicht nach Hyper-Hyperraum aus.",
    "action": "close"
    }
    ]
    },
    "open_beer": {
    "text": "Das Bier zischt auf und sprudelt ueber die Steckdose. Funken fliegen, und ploetzlich flackern die Lichter. Um dich wird es dunkel.",
    "choices": [
    {
    "text": "Schnell weiter, bevor jemand merkt, dass wir das waren.",
    "action": "close"
    }
    ]
    }
    },
    "Resonant": {
    "initial": {
    "text": "Resonant - Alter, das sieht ja aus wie bei Star Wars hier - also wenn dann gibts hier einen Hyperraumantrieb?",
    "choices": [
    {
    "text": "Ein verballerter Greis in langer brauner Kutte - lass den mal fragen.",
    "action": "spaced_out_man"
    },
    {
    "text": "Lass mal die alte Tankstellensaeule da anschauen",
    "action": "petrol_pump"
    }
    ]
    },
    "spaced_out_man": {
    "text": "Der Typ sieht aus als haette er 1000 Jahre nicht geschlafen. Er brabbelt vor sich hin und raucht eine lange Pfeiffe...",
    "choices": [
    {
    "text": "Komm wir fragen mal wegen dem Antrieb",
    "action": "druids_response"
    },
    {
    "text": "Der sieht nicht hilfreich aus.",
    "action": "close"
    }
    ]
    },
    "druids_response": {
    "text": "Der Greis schaut dir ins Gesicht und sagt: 'Das sind nicht die Druiden, nach denen ihr sucht...' Raucht an seiner Pfeiffe. Ihn nockt es komplett aus.",
    "choices": [
    {
    "text": "Puh, also das war nicht hilfreich.",
    "action": "close"
    }
    ]
    },
    "petrol_pump": {
    "text": "Die alte Tankstellensaeule steht da, verstaubt und mysterioes. Etwas summt in der Naehe, als ob sie ein Geheimnis birgt.",
    "choices": [
    {
    "text": "Naeher ran und genauer hinschauen.",
    "condition": "!acid_mode",
    "action": "petrol_pump_fly"
    },
    {
    "text": "Naeher ran und genauer hinschauen.",
    "condition": "acid_mode",
    "action": "petrol_pump_watto"
    }
    ]
    },
    "petrol_pump_fly": {
    "text": "Tanzstelle - Eine widerliche Fliege sitzt auf der Saeule.",
    "choices": [
    {
    "text": "LASS DIE FLIEGE NOCHMAL ANSCHAUEN, WENN WIR DRUFF SIND.",
    "action": "close"
    }
    ]
    },
    "petrol_pump_watto": {
    "text": "Eine fette Fliege, die auf der Zapsaeule sitzt, sieht in deiner ACID-Optik sieht aus wie Watto von Star Wars. Mega widerlich... Aber sie kann sprechen.",
    "choices": [
    {
    "text": "Hier hast du deinen Kaffee.",
    "condition": "hascoffee_for_watto",
    "action": "watto_completion_dialogue"
    },
    {
    "text": "Hallo magische Fliege, hast du den Hyper-Hyperraumantrieb?",
    "condition": "!hascoffee_for_watto",
    "action": "watto_dialogue"
    }
    ]
    },
    "watto_dialogue": {
    "text": "Die Fliege Watto faengt an zu sprechen: 'Ah! Den Hyper-Hyperraumantrieb du suchst, ja? Watto hat ihn, aber Watto ist sehr durstig! Bring mir einen Kaffee vom Platz mit der lauten Musik und der schlechten Sicht aus der hinteren Reihe, du musst!'",
    "choices": [
    {
    "text": "Ok, Weltraumfliege!",
    "action": "watto_quest"
    },
    {
    "text": "Dafuq.",
    "action": "watto_quest"
    }
    ]
    },
    "watto_quest": {
    "text": "Du nickst der Fliege zu und spuerst, wie die Quest in deinem Kopf pulsiert. Zeit, diesen Kaffee zu besorgen - die Galaxis haengt davon ab!",
    "choices": [
    {
    "text": "Ab zur Kaffeestand.",
    "action": "close"
    }
    ]
    },
    "watto_completion_dialogue": {
    "text": "Du schaust der Fliege tief in die Augen. 'Ahhhh, perfekt! Kaffee! trinkt Jetzt Watto kann dir geben den Hyper-Hyperraumantrieb!' Die Fliege kotet ein glaenzendes Geraet.",
    "choices": [
    {
    "text": "Misstrauisch fasst du tief in den Kot. Es ist tatsaechlich eine Maschine",
    "action": "give_hyperraumantrieb"
    }
    ]
    },
    "give_hyperraumantrieb": {
    "text": "Der Hyperraumantrieb glaenzt in deiner Hand, vibrierend mit kosmischer Energie. Du fuehlst dich wie ein Held aus einem Sci-Fi-Film - nur mit mehr Festival-Schweiß.",
    "choices": [
    {
    "text": "Schnell zurueck zum Polytron!",
    "action": "close"
    }
    ]
    }
    },
    "Vacanza": {
    "initial": {
    "text": "Ist das etwa Downtempo?! Ob es hier wohl Hyper-Hyper wird?",
    "choices": [
    {
    "text": "Geil, hier gibts ne Sauna.",
    "action": "feel_relaxed"
    },
    {
    "text": "Neeee, das sieht nicht nach Hyperraum aus.",
    "action": "close"
    }
    ]
    },
    "give_energy": {
    "text": "Du betrittst die Sauna, Dampf umhuellt dich wie ein warmer Trip. Deine Energie laedt sich auf, und du fuehlst dich bereit fuer das naechste Abenteuer - oder einen Nackttanz.",
    "choices": [
    {
    "text": "Frisch erholt weiterziehen.",
    "action": "close"
    }
    ]
    },
    "feel_relaxed": {
    "text": "Du fuehlst dich sehr entspannt und relaxed. Die warme Sauna-Atmosphaere hat dich komplett runtergekommen. Ploetzlich kommt dir ein Gedanke - jetzt waere der perfekte Moment, um den Hyper-Hyperraumantrieb zu finden!",
    "choices": [
    {
    "text": "Auf zur Suche nach dem Hyper-Hyperraumantrieb!",
    "action": "close"
    }
    ]
    }
    },
    "Looserlounge": {
    "initial": {
    "text": "Geil, die Looserlounge! Man munkelt hier gibts das beste Booking (und dass der Hausmeister auch als Artist gebucht ist).",
    "choices": [
    {
    "text": "Och, neee, Mathehausaufgaben.",
    "action": "do_homework"
    },
    {
    "text": "Hah, ich bin doch kein Looser, schnell weiter.",
    "action": "close"
    }
    ]
    },
    "do_homework": {
    "text": "Du setzt dich hin und knackst ein paar Matheaufgaben. Ploetzlich ergibt alles Sinn - Nur Fliegen koennen bei Hyper-Hyperraumantrieben helfen.",
    "choices": [
    {
    "text": "Woooo gibts hier Fliegen... Auf ACID sollte man die eigentlich finden koennen.",
    "action": "close"
    }
    ]
    }
    },
    "L300": {
    "initial": {
    "text": "Psychedelischer Fiebertraum. Alles pulsiert. Eigentlich kann man das nur auf Psychedelics ertragen. Vielleicht welche suchen?",
    "choices": [
    {
    "text": "Da ist so Mandala, lass das mal anschauen.",
    "action": "mandala_investigation"
    },
    {
    "text": "Zu bunt hier, lass mal hinter in den Wald",
    "action": "forest_exploration"
    }
    ]
    },
    "mandala_investigation": {
    "text": "Krasses Mandala-Rad. Dreht sich irgendwie in alle Richtungen. Klebt da nicht ein Papier dran? Das koennte doch...",
    "choices": [
    {
    "text": "Du schiebst dir das Papier in den Mund.",
    "action": "activate_acid_mode"
    },
    {
    "text": "Haha, das taugt bestimmt nichts. Lass mal was anderes ballern.",
    "action": "k_hole"
    }
    ]
    },
    "activate_acid_mode": {
    "text": "Das Papier loest sich auf deiner Zunge auf, und ploetzlich explodieren die Farben um dich herum. Die Welt wird zu einem wirbelnden Kaleidoskop - willkommen im Acid-Mode, Kumpel!",
    "choices": [
    {
    "text": "Trippig weiterforschen.",
    "action": "close"
    }
    ]
    },
    "forest_exploration": {
    "text": "Hinter der Bar ist ein mystischer Wald. Ein altes Orakel sitzt unter einem leuchtenden Baum, seine Augen reflektieren unendliche Weisheit - ists das ChatGPT?.",
    "choices": [
    {
    "text": "Lass den mal fragen.",
    "action": "oracle_wisdom"
    },
    {
    "text": "Zu dunkel hier.",
    "action": "close"
    }
    ]
    },
    "oracle_wisdom": {
    "text": "Das Orakel brabbelt vor sich hin: 'Kind des Kosmos, suche das, was dir wie eine Fliege erscheint. Nur diejenigen, die die Farben der Realitaet gekostet haben, sehen den Wahrheit, die darin liegt. (Es ist definitiv ChatGPT.)'",
    "choices": [
    {
    "text": "Danke Orakel.",
    "action": "close"
    }
    ]
    }
    },
    "Orgia": {
    "initial": {
    "text": "Geil, Orgia. Ist das wirklich Musik?",
    "choices": [
    {
    "text": "Dino-Bong rauchen.",
    "action": "dino_bong_pre_teleport"
    },
    {
    "text": "Bruder, viel zu intense.",
    "action": "close"
    }
    ]
    },
    "dino_bong_pre_teleport": {
    "text": "Fettttt, Dino-Bong - der Rauch fuellt deine Lungen mit praehistorischem Orgy-Feuer. Dinos tanzen, ha, hotdog, alles wird blurry... Dir waechst ein Dino-Schwanz!",
    "choices": [
    {
    "text": "Lass die Magie wirken und bewege dich!",
    "action": "dino_bong"
    }
    ]
    }
    },
    "Lila Drache": {
    "initial": {
    "text": "Apreski Musik. Wackelnde Schafe. Wild gekleidete Menschen machen eine Modenschau.",
    "choices": [
    {
    "text": "Rhababerschnaps trinken.",
    "action": "rhubarb_schnaps_pre_teleport"
    },
    {
    "text": "Lieber auf weiter und mal sehen, ob wir vielleicht am Psycare vorbeikommen.",
    "action": "close"
    }
    ]
    },
    "rhubarb_schnaps_pre_teleport": {
    "text": "Du kippst den Rhabarberschnaps runter, und er brennt wie fluessiges Feuer in deiner Kehle. Die Schafe beginnen zu fliegen, die Musik wird zu einem Wirbelsturm - dein Magen rebelliert, und du spuerst den Teleport kommen...",
    "choices": [
    {
    "text": "Ab in die Psycare!",
    "action": "teleport_psycare"
    }
    ]
    },
    "teleport_psycare": {
    "text": "Der Schnaps katapultiert dich in die Psycare-Ecke. Du landest weich, umgeben von beruhigenden Vibes und hilfsbereiten Seelen.",
    "choices": [
    {
    "text": "Ausnuechtern und weiter.",
    "action": "close"
    }
    ]
    }
    },
    "Nest": {
    "initial": {
    "text": "Das Nest - Es laeuft ein absurdes Hoerspiel und du meinst, die Klaenge einer Chimaere zu hoeren.",
    "choices": [
    {
    "text": "Kuschel dich ins warme Nestbettchen.",
    "action": "sleep_well"
    },
    {
    "text": "Schlacke trinken.",
    "action": "drink_schlacke"
    }
    ]
    },
    "sleep_well": {
    "text": "Du kuschelst dich ein, das Hoerspiel lullt dich in einen traumhaften Schlaf. Du wachst erfrischt wieder auf.",
    "choices": [
    {
    "text": "Aufstehen und abenteuern.",
    "action": "close"
    }
    ]
    },
    "drink_schlacke": {
    "text": "Brav mischst du deine Brause mit dem Underberg. Dein ganzer Bauchi sprudelt, verzweifelt ruelpst du dreimal und spuerst, wie dich das Zeug komplett wegballert...",
    "choices": [
    {
    "text": "Wo bin ich denn jetzt schon wieder??? Ah, Psycare...",
    "action": "teleport_psycare"
    }
    ]
    }
    },
    "Workshopspace": {
    "initial": {
    "text": "Einige Menschen Basteln hier und Basteln da.",
    "choices": [
    {
    "text": "Lass versuchen, einen Hyper-Hyperraumantrieb zu basteln!",
    "action": "bau_hyperraumantrieb"
    },
    {
    "text": "Kein Bock auf Basteln.",
    "action": "close"
    }
    ]
    },
    "bau_hyperraumantrieb": {
    "text": "HAHA, das waere viel zu einfach. Als ob du einfach sowas bauen kannst.",
    "choices": [
    {
    "text": "Nagut, dann muessen wir eben einen finden.",
    "action": "close"
    }
    ]
    },
    "give_knowledge": {
    "text": "Du tauchst in einen Workshop ein, bastelst und lernst. Ploetzlich klickt es - du weißt jetzt, wie man einen improvisierten Hyperantrieb baut. Du brauchst nurnoch eine?",
    "choices": [
    {
    "text": "Mit neuem Wissen weiter.",
    "action": "close"
    }
    ]
    }
    },
    "2. Reihe": {
    "initial": {
    "text": "2. Reihe - Endlich Housemusik. Bin ich jetzt hinter oder vor dem DJ?",
    "choices": [
    {
    "text": "Oh nice, lass mal ins Baumhaus klettern.",
    "action": "treehouse"
    },
    {
    "text": "Sweeeet, da gibts Kaffee!",
    "action": "coffee_stand"
    }
    ]
    },
    "treehouse": {
    "text": "Schnaufend kletterst du ins Baumhaus. Jetzt erstmal eine Line Keta zur Belohnung. Musik und Lichter werden intensiver... alles dreht sich... du merkst, dass du wegtrittst...",
    "choices": [
    {
    "text": "Versuch wach zu bleiben.",
    "action": "k_hole"
    },
    {
    "text": "Lass es dich ueberkommen.",
    "action": "k_hole"
    }
    ]
    },
    "k_hole": {
    "text": "Die Bahn war viel zu gross. Keine Chance, aufzustehen, jetzt ist K-Hole angesagt. Du merkst, wie du auf eine Kutsche geladen wirst. Retourkutsche...",
    "choices": [
    {
    "text": "Wo... Wo bin ich?! Ah, das ist doch der Psycare.",
    "action": "teleport_psycare"
    }
    ]
    },
    "coffee_stand": {
    "text": "Turbo Kaffee mit den besten Bohnen, geile Roestaromen. Der Barista schaut dich erwartend an.",
    "choices": [
    {
    "text": "Einen Kaffe, Herr Ober.",
    "condition": "!watto_wants_coffee",
    "action": "drink_coffee_simple"
    },
    {
    "text": "Einen Kaffe fuer mich und die Weltraumfliege bitte.",
    "condition": "watto_wants_coffee_and_acid_mode",
    "action": "drink_coffee_watto"
    },
    {
    "text": "Danke, nein - Bin eher der Pepp-Typ.",
    "action": "close"
    }
    ]
    },
    "drink_coffee_simple": {
    "text": "Der Kaffee ist heiß und stark, weckt dich auf wie ein Bassdrop. Du fuehlst dich energiegeladen, bereit fuer die naechsten Floors.",
    "choices": [
    {
    "text": "Weiter im Beat.",
    "action": "close"
    }
    ]
    },
    "drink_coffee_watto": {
    "text": "Du nimmst zwei Kaffee, einer fuer dich, einer fuer die Fliege. Der Duft mischt sich mit House-Beats - perfekt fuer eine intergalaktische Mission.",
    "choices": [
    {
    "text": "Zurueck zur Fliege.",
    "action": "close"
    }
    ]
    }
    }
    }